import React from "react";
import {
  chakra,
  Box,
  Heading,
  Link,
  Image,
  Skeleton,
  Text,
  Divider,
  HStack,
  Stack,
  Tag,
  Wrap,
  WrapItem,
  useColorModeValue,
  Container,
  VStack,
  Icon,
} from "@chakra-ui/react";
import { useNavigate } from "react-router-dom";
import "../app.css";
import { useParams } from "react-router-dom";


const ArticleList = () => {
  const pa = useParams();
  console.log();

  return (
    <Container maxW={"7xl"} p="125px">
      <Stack direction={{ base: "column", md: "row" }} justifyContent="center">
        <Stack
          direction="column"
          spacing={6}
          justifyContent="center"
          alignItems="center"
          maxW="600px">
          <HStack
            as={Link}
            p={1}
            rounded="full"
            fontSize="sm"
            w="max-content"
            bg={useColorModeValue("gray.300", "gray.700")}></HStack>
          <Box className="bg-grid"  position={"absolute"}></Box>
          <chakra.h1
            position={"relative"}
            fontSize="5xl"
            fontWeight="bold"
            textAlign="right"
            lineHeight={1.9}>
            <chakra.span color="blue.500" position={"absolute"} top={"-50px"}>
              👋
            </chakra.span>
            مرحبًا بك في موقعي <br></br> أنا محمد الربعي.
            <chakra.span color="blue.500"></chakra.span>
          </chakra.h1>
          <Text
            fontSize="1.3rem"
            textAlign="right"
            lineHeight="1.375"
            fontWeight="400"
            color="gray.500">
            هذا الموقع هو نافذتي للتعبير عن نفسي ومشاركة قصتي ورحلتي معك.
          </Text>
        </Stack>
      </Stack>
      <Heading as="h2" marginTop="5">
        من انا ؟
      </Heading>
      <Divider marginTop="5" />
      <Wrap spacing="30px" marginTop="5">
        <WrapItem width={{ base: "100%" }}>
          <Box w="100%">
            <Text
              as="p"
              fontSize="lg"
              marginTop="2"
              marginBottom={"6"}
              lineHeight={"2"}>
              أنا محمد عبد الرحمن الربعي من المملكة العربية السعودية، وأقيم في
              الرياض. أود أن أشارككم رحلتي الشخصية. منذ صغري، عشت في محافظة
              صغيرة في عسير بالقرب من القنفذة. قضيت هناك مرحلة التعليم الأساسي
              والثانوي، وكانت تلك فترة مليئة بالذكريات الجميلة التي ترافقت مع
              نموي وتطوري.{" "}
            </Text>
            <hr></hr>
            <Heading as="h2" marginTop="5" marginBottom={"5"}>
              المرحلة الجامعية
            </Heading>
            <Text
              as="p"
              fontSize="lg"
              marginTop={"5"}
              marginBottom={"5"}
              lineHeight={"2"}>
              بعد انتهاء مرحلة الثانوية العامة، قررت الانتقال إلى القنفذة
              لمتابعة دراستي في تخصص علوم الحاسب الآلي. كانت تلك فترة مثيرة
              ومفيدة جدًا، حيث اكتسبت المعرفة والمهارات الأساسية في مجال
              تكنولوجيا المعلومات. في عام 2020، أتممت تخرجي من الجامعة وشعرت
              بفخر كبير لتحقيق هذا الإنجاز الهام في حياتي.
            </Text>
            <hr></hr>
            <Heading as="h2" marginTop="5" marginBottom={"5"}>
              اكتشاف الشغف
            </Heading>
            <Text
              as="p"
              fontSize="lg"
              marginTop="2"
              marginBottom={"5"}
              lineHeight={"2"}>
              بعد التخرج، انتقلت إلى الرياض بحثًا عن فرصة عمل. كانت هذه الفترة
              تحديًا كبيرًا بالنسبة لي، حيث قضيت ما يقرب من السنة في البحث
              المستمر عن وظيفة مناسبة. تأثرت جهود البحث بتداعيات جائحة كورونا
              التي أثرت على فرص العمل في السوق. خلال تلك الفترة، كان لدي الكثير
              من الوقت الفارغ، وقررت استثماره في تعلم تطوير المواقع. استفدت من
              الخبرة التي اكتسبتها خلال دراستي الجامعية لأتعلم لغات الويب مثل
              HTML و CSS و JavaScript، بالإضافة إلى اكتساب أساسيات التصميم
              واستخدام إطار العمل Bootstrap. اكتشفت حقيقة شغفي في هذا المجال
              وأدركت أنني أرغب في التخصص فيه وتطوير مهاراتي فيه. قضيت معظم وقتي
              في تعلم أشياء جديدة وتنمية مهاراتي في تطوير الويب. كانت فترة ملهمة
              ومثيرة بالنسبة لي، حيث تعلمت تقنيات وأدوات جديدة وعملت على تحسين
              مستواي الفني. كانت تلك الفترة حاسمة في بناء أساس قوي لمستقبلي
              المهني كمطور ويب.
            </Text>
            <hr></hr>
            <Heading as="h2" marginTop="5" marginBottom={"5"}>
              الحصول على اول وظيفة
            </Heading>
            <Text
              as="p"
              fontSize="lg"
              marginTop={"5"}
              marginBottom={"5"}
              lineHeight={"2"}>
              بعد ذلك، تمكنت من الحصول على وظيفة في شركة صغيرة في البداية، حيث
              تم توظيفي كمحلل نظم معلومات من خلال برنامج تمهير. نظرًا لشغفي
              بتعلم البرمجة، قضيت أوقات فراغي في قسم البرمجة والتطوير داخل
              الشركة. خلال تلك الفترة، تمكنت من بناء علاقات قوية وأثرت بإيجابية
              في مجال عملي. في يوم من الأيام، طُلِبَ مني تحسين موقع الشركة
              للحصول على شهادة وترخيص من أحد الشركاء. قبلت التحدي وعملت على
              تحسين الموقع لمدة ثلاثة أسابيع، حيث قمت بتطبيق كل ما تعلمته في تلك
              المهمة. وبفضل الجهود المبذولة، أعجبت إدارة الشركة بالنتائج وقرروا
              توظيفي بشكل رسمي في قسم البرمجة وتطوير البرمجيات.
            </Text>
            <hr></hr>
            <Heading as="h2" marginTop="5" marginBottom={"5"}>
              برنامج طويق
            </Heading>
            <Text
              as="p"
              fontSize="lg"
              marginTop={"5"}
              marginBottom={"5"}
              lineHeight={"2"}>
              قد سمعت عن برنامج "طويق"، ومنذ البداية كنت متحمسًا للانضمام إليه.
              قدمت طلبًا لمسار تطوير تطبيقات الويب باستخدام JavaScript، وعلى
              الرغم من عدم قبولي في البداية، إلا أنني لم أفقد الأمل وقمت
              بالتقديم عدة مرات. وبفضل الله، تم قبولي في المعسكر الحالي لتطوير
              تطبيقات الويب باستخدام JavaScript. خلال الشهر الأول في المعسكر،
              استفدت بشكل كبير وتعلمت الكثير من الأشياء الجديدة. لقد قمت بتعلم
              أدوات وتقنيات مثل Node.js و Express.js و MongoDB، وهذا ساهم في
              تطوير قدراتي التقنية وزيادة معرفتي في مجال تطوير الويب. <br />{" "}
              والآن، ونحن في منتصف الشهر الثاني في المعسكر، أنا في مسار فرونت
              إند. تعلمت العديد من المهارات الجديدة مثل React و Chakra UI و
              Bootstrap. هذه المهارات تمكنني من بناء واجهات المستخدم الجذابة
              والمتطورة وتحسين تجربة المستخدم. أنا سعيد جدًا بالتقدم الذي أحرزته
              حتى الآن وبالخبرات القيمة التي اكتسبتها. أعتقد أن المعسكر يوفر لي
              الأساس القوي الذي سيمكنني من النجاح في مجال تطوير الويب. أنا متحمس
              للاستمرار في تعلم المزيد وتطوير مهاراتي الفنية والمهنية. أود أن
              أشكر فريق "طويق" على الفرصة الرائعة والتدريب الممتاز الذي يقدمونه.
              أنا ممتن للمدربين المتميزين الذين يقدمون المعرفة والدعم اللازمين
              لنا للنمو والتطور. كما أود أن أشكر زملائي في المعسكر الذين
              يشاركونني الرحلة والتجارب
            </Text>
            <hr></hr>
            <Heading as="h2" marginTop="5" marginBottom={"5"}>
              شكرا
            </Heading>
            <Text
              as="p"
              fontSize="lg"
              marginTop={"5"}
              marginBottom={"5"}
              lineHeight={"2"}>
              في ختام رحلتي الشخصية، أود أن أعبر عن امتناني العميق لكل الفرص
              التي واجهتها والتحديات التي تخطيتها. كل تلك الخبرات والمراحل
              العديدة في حياتي ساهمت في بناء شخصيتي وتطوير مهاراتي. أنا ممتن لكل
              الأشخاص الذين كانوا جزءًا من رحلتي وساعدوني في الوصول إلى هذا
              المستوى. أيضًا، أشكر برنامج "طويق" والأكاديمية التي قدمت لي الفرصة
              للتعلم والتطوير في مجال تطوير الويب. لقد استفدت كثيرًا من هذا
              المعسكر وأنا متحمس للاستمرار في تعلم المزيد وتحقيق نجاحات جديدة.
              أخيرًا، أود أن أشجع كل شخص يقرأ رحلتي على متابعة شغفه وتحقيق
              أحلامه. لا تخف من مواجهة التحديات والسعي للتعلم المستمر، فالنجاح
              يأتي لأولئك الذين يجرؤون على المحاولة والتطور. شكرًا لكم جميعًا
              على الاهتمام والدعم، وأتمنى لكم كل التوفيق في رحلاتكم الشخصية
              والمهنية.
            </Text>
          </Box>
        </WrapItem>
      </Wrap>
    </Container>
  );
};

export default ArticleList;
